#!/usr/bin/env python
# -*- coding:utf-8 -*-  
#====#====#====#====   
#Author:
#CreatDate:
#Version: 
#====#====#====#====
a=10
b=20
c=30
a+=b*c-a/10#600-1=599+10=609
print(int(a))
#案例:a=10,b=20,计算表达式a+b>30>>2*3的值,写出计算过程
#+ > >> *
#* + >> >
#a+b>30>>6
#30>30>>6
#00011110>>6  00000000
#30>0
#True
a2=10
b2=20
print(a2+b2>30>>2*3)
if a2+b2>30>>2*3:
    pass
else:
    pass
#案例:a1=2,b1=3,c1=4,计算表达式 c1+=a1**2+b1*3>c1/2的值,写出计算过程
#+= ** + * > /
#** * / + > +=
#c1+=4+b1*3>c1/2
#c1+=4+9>c1/2
#c1+=4+9>2'
#c1+=13>2
#c1+=True
#4+=1==>5
a1=2
b1=3
c1=4
c1+=a1**2+b1*3>c1/2
print(c1)

