#!/usr/bin/env python
# -*- coding:utf-8 -*-  
#====#====#====#====   
#Author:
#CreatDate:
#Version: 
#====#====#====#====
'''
集合的交集,并集,差集,对称差集的运算
{1,2,3,4}交集{4,5,6,7} -->4   交集(&)
{1,2,3,4}并集{4,5,6,7} ->1,2,3,4,5,6,7  并集(|)
{1,2,3,4}差集{4,5,6,7} ->1,2,3  差集(-)
{1,2,3,4}对称差集{4,5,6,7}->1,2,3,5,6,7 4同时出现在两个集合中,不选它 对称差集(^)
'''
s1={1,2,3,4}
s2={4,5,6,7}
print(s1&s2)
print(s1|s2)
print(s1-s2)
print(s1^s2)
print("--------------")
#案例:使用花括号和set创建各一个集合,然后对集合进行交、并、差、对称差运算
#{8,9,1,2,3},{1,2,4,6}
s3={8,9,1,2,3}
s4=set([1,2,4,6])
print(s3)
print(s4)

print(s3&s4)
print(s3|s4)
print(s3-s4)
print(s3^s4)