#!/usr/bin/env python
# -*- coding:utf-8 -*-  
#====#====#====#====   
#Author:
#CreatDate:
#Version: 
#====#====#====#====

d={1:'a',2:'c'}
# 字典的添加修改删除
# 1.添加:d[3]='c'#如果没有键位3的,那么就添加了一对键值对,如果有就是修改值
# 2.修改:
# 3.删除:
# d[1]='c'
# print(d)
d2={1:'a',2:'b',3:'c',4:'d'}
print(d2.pop(4))#d,返回被删除的value值,这里移除键值为4的元素
print(d2)
d2.popitem()#随机删除,一般删除末尾
print(d2)
del d2[1]#删除元素
print(d2)
d2.clear()#清空字典
print(d2)
del d2#删除字典
#print(d2)

#案例:把1-100的单数当成字典的键,偶数当成字典的值,创建一个字典,然后增加{'name':'maker'},
#{1:'one'}数据
'''
{1:0,3:0,5:0}
定义一个字典
for循环   range(1,101):
    判断,如果是单数:
        字典[单数]=0
    判断,如果是偶数:
        字典[i-1]=i
字典[name]='maker'
vv={1:'one'}
字典.update(vv)
'''

#案例:上一题的基础上,删除11键元素,返回他的值,然后打印.随机删除上一题的一对键值对,并打印
#然后清空并删除字典
'''
print(字典.pop(11))
print(字典.popitem())

'''
